Conf.Simple/src/Enums/SUI_ПредопределенныеНастройкиПодсистемы/SUI_ПредопределенныеНастройкиПодсистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ПредопределенныеНастройкиПодсистемы</name>
  <enumValues>
    <name>УправлениеТорговлей11</name>
  </enumValues>
  <enumValues>
    <name>УправлениеНашейФирмой</name>
  </enumValues>
  <enumValues>
    <name>Розница30</name>
  </enumValues>
  <enumValues>
    <name>Розница23</name>
  </enumValues>
  <enumValues>
    <name>ЕРП</name>
  </enumValues>
  <enumValues>
    <name>Бухгалтерия</name>
  </enumValues>
  <enumValues>
    <name>КомплекснаяАвтоматизация</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/CommonModules/SUI_ШтрихкодыУпаковокКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПредопределенныйАлгоритмНормализацииЗначенияШтрихкода(КонфигурацияНастройки) Экспорт
	
	Алгоритм = "";
	
	Если КонфигурацияНастройки = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11") Или
		КонфигурацияНастройки = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница23") Или
		КонфигурацияНастройки = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница30") Или
		КонфигурацияНастройки = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеНашейФирмой") Тогда
		Алгоритм = "РезультатРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ЗначениеШтрихкода);
		|
		|Если ЗначениеЗаполнено(РезультатРазбора) Тогда
		|	ЗначениеШтрихкода = РезультатРазбора.НормализованныйКодМаркировки;
		|Иначе
		|	ЗначениеШтрихкода = """";
		|КонецЕсли;";
	КонецЕсли;
	
	Возврат Алгоритм;
	
КонецФункции

Функция ПредопределенныйАлгоритмСозданияШтрихкодаУпаковки(КонфигурацияНастройки) Экспорт
	
	Алгоритм = "";
	
	Если КонфигурацияНастройки = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11") Или
		КонфигурацияНастройки = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница23") Или
		КонфигурацияНастройки = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница30") Или
		КонфигурацияНастройки = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеНашейФирмой") Тогда
		Алгоритм = "ШтрихкодУпаковки = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьПоЗначениюШтрихкода(ЗначениеШтрихкода);
		|
		|Если Не ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда
		|	
		|	РезультатРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ЗначениеШтрихкода);
		|
		|	Если ЗначениеЗаполнено(РезультатРазбора) Тогда
		|
		|		СтруктураСоздания = Справочники.ШтрихкодыУпаковокТоваров.СтруктураСозданияШтрихкодаУпаковки();
		|		СтруктураСоздания.Номенклатура = Номенклатура;
		|		СтруктураСоздания.Характеристика = Характеристика;
		|		СтруктураСоздания.Серия = Серия;
		|		СтруктураСоздания.Упаковка = Упаковка;
		|		СтруктураСоздания.Штрихкод = РезультатРазбора.НормализованныйКодМаркировки;
		|		СтруктураСоздания.ТипШтрихкода = РезультатРазбора.ТипШтрихкода;
		|
		|		Если РезультатРазбора.ВидУпаковки = ПредопределенноеЗначение(""Перечисление.ВидыУпаковокИС.Потребительская"") Тогда
		|			СтруктураСоздания.ТипУпаковки = ПредопределенноеЗначение(""Перечисление.ТипыУпаковок.МаркированныйТовар"");
		|		ИначеЕсли РезультатРазбора.ВидУпаковки = ПредопределенноеЗначение(""Перечисление.ВидыУпаковокИС.Групповая"") Тогда
		|			СтруктураСоздания.ТипУпаковки = ПредопределенноеЗначение(""Перечисление.ТипыУпаковок.МонотоварнаяУпаковка"");
		|		ИначеЕсли РезультатРазбора.ВидУпаковки = ПредопределенноеЗначение(""Перечисление.ВидыУпаковокИС.Логистическая"") И
		|			РезультатРазбора.СоставКодаМаркировки.Свойство(""GTIN"") И
		|			ЗначениеЗаполнено(РезультатРазбора.СоставКодаМаркировки.GTIN) Тогда
		|			СтруктураСоздания.ТипУпаковки = ПредопределенноеЗначение(""Перечисление.ТипыУпаковок.МонотоварнаяУпаковка"");
		|		Иначе
		|			СтруктураСоздания.ТипУпаковки = ПредопределенноеЗначение(""Перечисление.ТипыУпаковок.МультитоварнаяУпаковка"");
		|		КонецЕсли;
		|
		|		ДополнительныеПараметрыСоздания = Справочники.ШтрихкодыУпаковокТоваров.ДополнительныеПараметрыСозданияШтрихкодовУпаковок();
		|
		|		ШтрихкодУпаковки =  Справочники.ШтрихкодыУпаковокТоваров.СоздатьШтрихкодУпаковки(СтруктураСоздания, , , , ДополнительныеПараметрыСоздания);
		|
		|	КонецЕсли;
		|
		|КонецЕсли;";
	КонецЕсли;
	
	Возврат Алгоритм;
	
КонецФункции

// Выполняет проверку на соответствие алфавиту кода маркировки.
//
// Параметры:
//  Штрихкод - Строка - Штрихкод упаковки.
//  Алфавит - Строка - перечень допустимых символов.
// Возвращаемое значение:
//  Булево - Истина, если код соответствует алфавиту.
Функция ШтрихкодСоответствуетАлфавиту(Штрихкод, Алфавит) Экспорт
	
	ДлинаКода = СтрДлина(Штрихкод);
	
	Индекс = 1;
	Пока Индекс <= ДлинаКода Цикл
		
		ПроверяемыйСимвол = Сред(Штрихкод, Индекс, 1);
		
		Если СтрНайти(Алфавит, ПроверяемыйСимвол) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия() Экспорт
	Возврат НСтр("ru = 'Штрихкоды упаковок'");
КонецФункции

#КонецОбласти
